Что необходимо сделать
Создать пользовательские поля
"Топливо. Какой договор нужен клиенту?"
Создать пользовательское поле "Топливо. Какой договор нужен клиенту?".
Настройки поля:

Тип – список;
Объект – CRM_DEAL;
Код поля – UF_CRM_DEAL_CONTRACT_TYPE_FUEL;
Внешний вид – флажки;
Множественное – да;
Обязательное – нет;
Настроить значения списка:

Татнефть
XML_ID = TATNEFT
SORT = 100
ЭТР
XML_ID = ETR
SORT = 200
Также задать языковые настройки поля:

Подпись в форме редактирования – "Топливо. Какой договор нужен клиенту?";
Заголовок в списке – "Топливо. Какой договор нужен клиенту?";
Подпись фильтра в списке – "Топливо. Какой договор нужен клиенту?".
Значения остальных настроек не заполнять (оставить значения по умолчанию).

"Топливо. Анкета должной осмотрительности"
Создать пользовательское поле "Топливо. Анкета должной осмотрительности".
Настройки поля:

Тип – файл;
Объект – CRM_DEAL;
Код поля – UF_CRM_DEAL_DDQ_FUEL;
Множественное – да;
Также задать языковые настройки поля:

Подпись в форме редактирования – "Топливо. Анкета должной осмотрительности";
Заголовок в списке – "Топливо. Анкета должной осмотрительности";
Подпись фильтра в списке – "Топливо. Анкета должной осмотрительности".
Значения остальных настроек не заполнять (оставить значения по умолчанию).

"Топливо. Финансовая отчетность. Для ИП"
Создать пользовательское поле "Топливо. Финансовая отчетность. Для ИП".
Настройки поля:

Тип – файл;
Объект – CRM_DEAL;
Код поля – UF_CRM_DEAL_IP_FINANCIAL_STATEMENT_FUEL;
Множественное – да;
Также задать языковые настройки поля:

Подпись в форме редактирования – "Топливо. Финансовая отчетность. Для ИП";
Заголовок в списке – "Топливо. Финансовая отчетность. Для ИП";
Подпись фильтра в списке – "Топливо. Финансовая отчетность. Для ИП".
Значения остальных настроек не заполнять (оставить значения по умолчанию).

Дополнительная информация
Поля будут внесены в проверку заполненности обязательных полей в шаблоне БП стадии "Реквизиты запрошены"

Ресурсы
ТЗ:
https://cargonomica.teamly.ru/space/d6248f4a-22ee-4f3f-a3d5-32717685ac97/article/42e67104-94f5-4690-a2de-e2fd40147e05

п. 5.2.2 Создание поля в карточке сделки:
https://cargonomica.teamly.ru/space/d6248f4a-22ee-4f3f-a3d5-32717685ac97/article/42e67104-94f5-4690-a2de-e2fd40147e05#057749d9-72f0-4889-a930-6b6015d6b99f
